In [28]:
import pandas as pd
data =pd.read_csv('student_data.csv')
data

,Student_ID,Name,Age,Gender,Math_Score,Science_Score,Attendance,City
0,101,Amit,20.0,Male,85.0,78.0,90.0,Delhi
1,102,Neha,21.0,Female,88.0,NaN,85.0,Mumbai
2,103,Rahul,NaN,Male,70.0,65.0,NaN,Bangalore
3,104,Priya,22.0,Female,NaN,72.0,88.0,NaN
4,105,Ankit,20.0,Male,60.0,55.0,75.0,Delhi
5,106,Simran,21.0,Female,92.0,89.0,NaN,Chennai
6,107,NaN,23.0,Male,75.0,NaN,80.0,Hyderabad
7,108,Kavya,22.0,Female,80.0,77.0,92.0,Mumbai

In [5]:
data.isnull()

,Student_ID,Name,Age,Gender,Math_Score,Science_Score,Attendance,City
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,True,False,False
2,False,False,True,False,False,False,True,False
3,False,False,False,False,True,False,False,True
4,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,True,False
6,False,True,False,False,False,True,False,False
7,False,False,False,False,False,False,False,False

In [6]:
data.isnull().sum()

Student_ID       0
Name             1
Age              1
Gender           0
Math_Score       1
Science_Score    2
Attendance       2
City             1
dtype: int64

In [8]:
data.dropna(axis=1)

   Student_ID  Gender
0         101    Male
1         102  Female
2         103    Male
3         104  Female
4         105    Male
5         106  Female
6         107    Male
7         108  Female

In [33]:
data.dropna(how='any')

,Student_ID,Name,Age,Gender,Math_Score,Science_Score,Attendance,City
0,101,Amit,20.0,Male,85.0,78.0,90.0,Delhi
4,105,Ankit,20.0,Male,60.0,55.0,75.0,Delhi
7,108,Kavya,22.0,Female,80.0,77.0,92.0,Mumbai

In [17]:
data.fillna(0)

,Student_ID,Name,Age,Gender,Math_Score,Science_Score,Attendance,City
0,101,Amit,20.0,Male,85.0,78.0,90.0,Delhi
1,102,Neha,21.0,Female,88.0,0.0,85.0,Mumbai
2,103,Rahul,0.0,Male,70.0,65.0,0.0,Bangalore
3,104,Priya,22.0,Female,0.0,72.0,88.0,0
4,105,Ankit,20.0,Male,60.0,55.0,75.0,Delhi
5,106,Simran,21.0,Female,92.0,89.0,0.0,Chennai
6,107,0,23.0,Male,75.0,0.0,80.0,Hyderabad
7,108,Kavya,22.0,Female,80.0,77.0,92.0,Mumbai

In [29]:
data['City'].fillna('unknown')

0        Delhi
1       Mumbai
2    Bangalore
3      unknown
4        Delhi
5      Chennai
6    Hyderabad
7       Mumbai
Name: City, dtype: object

In [30]:
data['Age'].fillna(data['Age'].mean())

0    20.000000
1    21.000000
2    21.285714
3    22.000000
4    20.000000
5    21.000000
6    23.000000
7    22.000000
Name: Age, dtype: float64